nbd_fio_results/dev-nbd0_2023-07-17_17:16/rand_r_nbd0_2iodepth_1threads/1024.txt
rand-read: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=2
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nbd0 failed: Permission denied

rand-read: (groupid=0, jobs=1): err= 0: pid=14606: Mon Jul 17 17:23:18 2023
   read: IOPS=1746, BW=1747MiB/s (1832MB/s)(34.1GiB/20001msec)
    slat (usec): min=33, max=444, avg=60.59, stdev= 9.56
    clat (usec): min=637, max=1768, avg=1082.52, stdev=67.11
     lat (usec): min=690, max=1881, avg=1143.33, stdev=66.39
    clat percentiles (usec):
     |  1.00th=[  873],  5.00th=[  988], 10.00th=[ 1012], 20.00th=[ 1045],
     | 30.00th=[ 1057], 40.00th=[ 1074], 50.00th=[ 1090], 60.00th=[ 1090],
     | 70.00th=[ 1106], 80.00th=[ 1123], 90.00th=[ 1156], 95.00th=[ 1172],
     | 99.00th=[ 1287], 99.50th=[ 1352], 99.90th=[ 1483], 99.95th=[ 1549],
     | 99.99th=[ 1663]
   bw (  MiB/s): min= 1722, max= 1838, per=100.00%, avg=1746.85, stdev=17.88, samples=40
   iops        : min= 1722, max= 1838, avg=1746.85, stdev=17.88, samples=40
  lat (usec)   : 750=0.09%, 1000=6.54%
  lat (msec)   : 2=93.37%
  cpu          : usr=0.74%, sys=6.17%, ctx=257507, majf=0, minf=1071
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=34938,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
   READ: bw=1747MiB/s (1832MB/s), 1747MiB/s-1747MiB/s (1832MB/s-1832MB/s), io=34.1GiB (36.6GB), run=20001-20001msec

Disk stats (read/write):
  nbd0: ios=277954/0, merge=0/0, ticks=244330/0, in_queue=222805, util=99.62%